import { Component, OnInit, Input } from '@angular/core';

@Component({
  selector: 'app-thrash',
  templateUrl: './thrash.component.html',
  styleUrls: ['./thrash.component.css']
})
export class ThrashComponent implements OnInit {

  /*thrashContent = 'Трэш-метал (thrash — англ. бить, молотить, крошить) — музыкальное направление в метале, давшее начало всем экстремальным его разновидностям. Характеризуется достаточно высокой скоростью исполнения, большей жёсткостью пробивных, быстрых, исполненных в низком диапазоне частот риффов по сравнению с классическим хэви-металом и агрессией вкупе с техничным, кромсающим, молотящим, скоростным стилем гитарных соло в высоком диапазоне частот и басово-гитарным тремоло.' +
' Истоки трэш-метала, по общему мнению, восходят к концу 1970-х годов — началу 1980-х годов, когда некоторые металические группы привнесли экстремальную скорость хардкор-панка в традиционную мелодику и ритмическую структуру метала. Venom и особенно Motörhead обычно рассматриваются в качестве групп, давших толчок развитию трэш-метала.' +
' Существует такое понятие, как «Большая четвёрка трэш-метала». В неё входят четыре группы, исполняющие музыку в жанре трэш-метал: Metallica, Megadeth, Slayer и Anthrax. Считается, что творчество этих коллективов положило начало развитию данного направления в музыке. Наиболее известными американскими трэш-группами помимо вышеназванных исполнителей считаются Exodus, Overkill и Testament.';

  title = 'THR';*/
  constructor() { }

  ngOnInit() {
  }



}
